Repository: ServerSoftwares/desafio-flutter
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# moonPhasePageLocationDisabled
source: Location services are disabled. Please enable the services
pt_br: Serviços de localização desabilitados. Por favor, os habilite.

# moonPhasePagePermissionDenied
source: Location permissions are denied
pt_br: Permissão de acesso à localização negada.

# moonPhasePagePermissionPermanentlyDenied
source: Location permissions are permanently denied, we cannot request permissions.
pt_br: Permissão de acesso à localização permanentemente negada, não podemos solicitar solicitar perrmissão.

# moonPhasePageAppBarTitle
source: Observer App
pt_br: Observador App

# moonPhasePagePickDate
source: Pick a date:
pt_br: Selecione uma data:

# genericError
source: An error has occurred!
pt_br: Ocorreu um erro!

# failedConnection
source: Connection failed!
pt_br: Falha de conexão!

source: Try Again
pt_br: Tente Novamente

# celestialBodyPageAppBarTitle
source: Celestial Bodies
pt_br: Corpos Celestes

# celestialBodyPagePickBody
source: Pick a body:
pt_br: Selecione um corpo celeste:

# celestialBodyPagePickBodyPosition
source: Position (degrees):
pt_br: Posição (graus):

# celestialBodyPagePickBodyDistance
source: Distance from Earth (Km):
pt_br: Distância da Terra (Km):

# starChartPageAppBarTitle
source: Star Chart
pt_br: Constelações

# starChatPagePickConstellation
source: Pick a constellation
pt_br: Selecione uma constelação
